<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Uses parent pkg recipe to download latest Google Chrome Enterprise installer package and import it into the JSS.</string>
        <key>Identifier</key>
        <string>com.github.wzrdprst.jss.ChromeEnterprise</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Google Chrome</string>
            <key>GROUPNAME</key>
            <string>GoogleChrome</string>
            <key>JSS_INVENTORY_NAME</key>
            <string>Google Chrome.app</string>
            <key>CATEGORY</key>
            <string>Browsers</string>
            <key>DESCRIPTION</key>
            <string>Google Chrome is a browser that combines a minimal design with sophisticated technology to make the web faster, safer, and easier.</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.autopkg.pkg.googlechromepkg</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>jss_inventory_name</key>
                    <string>%JSS_INVENTORY_NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
